FAM = 'ФЭМ'
FPM = 'ФПМ'

fam = ['Э', 'М']
fpm = ['П', 'Д']

TITLE = ['Э', 'П', 'М', 'Д']
YEAR = ['2019', '2017', '2018', '2019', '2020']
NUM = ['1', '2', '3']

NAME = ['Николай', 'Дмитрий', 'Богдан', 'Руслан', 'Владимир', 'Андрей', 'Сергей', 'Лев', 'Михаил', 'Александр']
SURNAME = ['Иванов', 'Петров', 'Сидоров', 'Николаев', 'Сергеев', 'Алексеев', 'Непоседов', 'Кругомбегов',
           'Спатьнехотелов', 'Меблепортель']
PATRONYMIC = ['Николаевич', 'Дмитриевич', 'Богданович', 'Владимирович', 'Андреевич', 'Львович', 'Русланович',
              'Сергеевич', 'Михайлович', 'Александрович']

GRADES = [3, 4, 4, 5]

L_SUBJ = ['Программирование', 'Высшая математика', 'Микроэкономика', 'Статистика']